ka2_2024/src/Documents/ВыработкаСотрудников/ВыработкаСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыработкаСотрудников</name>
  <registerRecords>AccumulationRegister.ТрудозатратыНезавершенногоПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccumulationRegister.ЗначенияОперативныхПоказателейРасчетаЗарплатыСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.ТрудозатратыКОформлению</registerRecords>
  <attributes>
    <name>Автораспределение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНаряда</name>
    <type>
      <types>EnumRef.ВидыБригадныхНарядов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКТУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьТарифныеСтавки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтработанноеВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнители</name>
    <comment>Краткий перечень исполнителей, включенных в документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетТрудозатратВРазрезеСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыРабот</name>
    <attributes>
      <name>Работник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.ВидыРаботСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DocumentRef.ПроизводствоБезЗаказа</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <type>
        <types>CatalogRef.СтатьиКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКОплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Расценка</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиРаспоряжения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаПродукции</name>
      <type>
        <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОтраженияЗарплаты</name>
      <type>
        <types>CatalogRef.СпособыОтраженияЗарплатыВБухУчете</types>
      </type>
    </attributes>
    <attributes>
      <name>КвалификацияИсполнителя</name>
      <type>
        <types>CatalogRef.РазрядыКатегорииДолжностей</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКОформлению</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыполненияРабот</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Работники</name>
    <attributes>
      <name>Работник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>КТУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифнаяСтавка</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноЧасов</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ka2_2024/src/CommonModules/ОперативныйУчетПроизводстваВызовСервера/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОУП: Процедуры подсистемы оперативного учета производства
//
////////////////////////////////////////////////////////////////////////////////


#Область СлужебныеПроцедурыИФункции


// Возвращает структуру заполнения для формирования документов выработки по переданному отбору или строкам распоряжений.
// В функции выполняется анализ количества документов к формированию, если требуется сформировать один документ, то
// возвращается структура заполнения, иначе параметры отбора для группового формирования.
//
// Параметры:
//	Отбор	- Структура - Содержит данные для отбора:
//  						* Распоряжения - Массив - документы, на основании которых оформляется выработка
//  						* Подразделения - Массив - подразделения, по которым оформляется выработка
//	Идентификаторы	- Массив - идентификаторы, если следующим параметром передается коллекция аналитик к оформлению
//	Коллекция	- ДанныеФормыКоллекция - коллекция аналитик, по которым оформляется выработка.
//
// Возвращаемое значение:
//   Структура   - содержит поля для заполнения новых документов.
//
Функция ПараметрыОформленияВыработкиСотрудников(Отбор = Неопределено, Идентификаторы = Неопределено, Коллекция = Неопределено) Экспорт
	
	Если Отбор <> Неопределено Тогда
		КОформлению = Документы.ВыработкаСотрудников.ТрудозатратыКОформлению(Отбор);
		Строки = КОформлению.Выгрузить();
	Иначе
		Строки = Идентификаторы;
	КонецЕсли;
	
	Если Строки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Подразделения = Новый Массив;
	Периоды = Новый Массив;
	Бригады = Новый Массив;
	Работники = Новый Массив;
	Сотрудники = Новый Массив;
	Организации = Новый Массив;
	Распоряжения = Новый Массив;
	ВидыНарядов = Новый Массив;
	СтруктурныйОтбор = Новый Массив;
	
	// параметры проверки количества документов
	ТекущаяОрганизация = Неопределено;
	ТекущееПодразделение = Неопределено;
	ТекущийВидНаряда = Неопределено;
	ТекущаяБригада = Неопределено;
	ТекущееНачалоПериода = Неопределено;
	ТекущийКонецПериода = Неопределено;
	ТекущийМесяц = Неопределено;
	
	ТребуетсяОдинДокумент = Истина;
	
	Для Каждого Итератор Из Строки Цикл
		
		Если Коллекция <> Неопределено Тогда
			Строка = Коллекция.НайтиПоИдентификатору(Итератор);
		Иначе
			Строка = Итератор;
		КонецЕсли;
		
		Если ТекущаяОрганизация = Неопределено Тогда
			ТекущаяОрганизация = Строка.Организация;
		ИначеЕсли ТекущаяОрганизация <> Строка.Организация Тогда
			ТребуетсяОдинДокумент = Ложь;
		КонецЕсли;
		
		Если ТекущееПодразделение = Неопределено Тогда
			ТекущееПодразделение = Строка.Подразделение;
		ИначеЕсли ТекущееПодразделение <> Строка.Подразделение Тогда
			ТребуетсяОдинДокумент = Ложь;
		КонецЕсли;
		
		Если ТекущийВидНаряда = Неопределено Тогда
			ТекущийВидНаряда = Строка.ВидНаряда;
		ИначеЕсли ТекущийВидНаряда <> Строка.ВидНаряда Тогда
			ТребуетсяОдинДокумент = Ложь;
		КонецЕсли;
		
		Если ТекущаяБригада = Неопределено И ЗначениеЗаполнено(Строка.Бригада) Тогда
			ТекущаяБригада = Строка.Бригада;
		ИначеЕсли ТекущаяБригада <> Строка.Бригада И ЗначениеЗаполнено(Строка.Бригада) Тогда
			ТребуетсяОдинДокумент = Ложь;
		КонецЕсли;
		
		Если ТекущееНачалоПериода = Неопределено Тогда
			ТекущееНачалоПериода = Строка.НачалоПериода;
		ИначеЕсли ТекущееНачалоПериода <> Строка.НачалоПериода Тогда
			ТребуетсяОдинДокумент = Ложь;
		КонецЕсли;
		
		Если ТекущийКонецПериода = Неопределено Тогда
			ТекущийКонецПериода = Строка.КонецПериода;
		ИначеЕсли ТекущийКонецПериода <> Строка.КонецПериода Тогда
			ТребуетсяОдинДокумент = Ложь;
		КонецЕсли;
		
		Месяц = НачалоМесяца(?(ЗначениеЗаполнено(Строка.ДатаВыполнения), Строка.ДатаВыполнения, Строка.НачалоПериода));
		Если ТекущийМесяц = Неопределено Тогда
			ТекущийМесяц = Месяц
		ИначеЕсли ТекущийМесяц <> Месяц Тогда
			ТребуетсяОдинДокумент = Ложь;
		КонецЕсли;

		Подразделения.Добавить(Строка.Подразделение);
		Периоды.Добавить(Строка.НачалоПериода);
		Организации.Добавить(Строка.Организация);
		ВидыНарядов.Добавить(Строка.ВидНаряда);
		
		Если ЗначениеЗаполнено(Строка.Бригада) Тогда
			Бригады.Добавить(Строка.Бригада);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.Работник) Тогда
			Работники.Добавить(Строка.Работник);
		КонецЕсли;
		
		//++ Локализация
		Если ЗначениеЗаполнено(Строка.Исполнитель) И ТипЗнч(Строка.Исполнитель) = Тип("СправочникСсылка.Сотрудники") Тогда
			Сотрудники.Добавить(Строка.Исполнитель);
		КонецЕсли;
		//-- Локализация
		
		Если ЗначениеЗаполнено(Строка.Распоряжение) Тогда
			Распоряжения.Добавить(Строка.Распоряжение);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.ВидНаряда) И ЗначениеЗаполнено(Строка.Подразделение) Тогда
			СтруктураОтбора = Новый Структура("Подразделение, ВидНаряда, Бригада");
			СтруктураОтбора.Подразделение = Строка.Подразделение;
			СтруктураОтбора.ВидНаряда = Строка.ВидНаряда;
			СтруктураОтбора.Бригада = ?(ЗначениеЗаполнено(Строка.Бригада), Строка.Бригада, ПредопределенноеЗначение("Справочник.Бригады.ПустаяСсылка"));
			СтруктурныйОтбор.Добавить(СтруктураОтбора);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Новый Структура;
	
	Результат.Вставить("Подразделения",   Подразделения);
	Результат.Вставить("Периоды",         Периоды);
	Результат.Вставить("Бригады",         Бригады);
	Результат.Вставить("Работники",       Работники);
	Результат.Вставить("Сотрудники",      Сотрудники);
	Результат.Вставить("Организации",     Организации);
	Результат.Вставить("Распоряжения",    Распоряжения);
	Результат.Вставить("ВидыНарядов",     ВидыНарядов);
	
	Результат.Вставить("ВключатьВПериодВыполненияРабот", Истина);
	
	Результат.Вставить("СтруктурныйОтбор", СтруктурныйОтбор);
	
	Результат.Вставить("ТребуетсяОдинДокумент", ТребуетсяОдинДокумент);
	
	Если ТребуетсяОдинДокумент Тогда
		
		Результат.Вставить("Подразделение",     ТекущееПодразделение);
		Результат.Вставить("Организация",       ТекущаяОрганизация);
		Результат.Вставить("ВидНаряда",         ТекущийВидНаряда);
		Результат.Вставить("НачалоПериода",     ТекущееНачалоПериода);
		Результат.Вставить("КонецПериода",      ТекущийКонецПериода);
		Результат.Вставить("Месяц",             ТекущийМесяц);
		
		Если ЗначениеЗаполнено(ТекущаяБригада) Тогда
			Результат.Вставить("Бригада",       ТекущаяБригада);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


// Формирует документы "Выработка сотрудников" по переданному отбору.
//
// Параметры:
//	СтруктураОтбора	- Структура - Содержит данные для отбора:
//  						* Распоряжения - Массив - документы, на основании которых оформляется выработка
//  						* Подразделения - Массив -  подразделения, по которым оформляется выработка.
//
// Возвращаемое значение:
//   Структура   - содержит массивы сформированных документов и сообщений пользователю.
//
Функция СформироватьВыработкуСотрудниковПоОтбору(СтруктураОтбора) Экспорт
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(Неопределено);
	Документы.ВыработкаСотрудников.СформироватьДокументы(СтруктураОтбора, АдресВХранилище);
	
	Возврат ПолучитьИзВременногоХранилища(АдресВХранилище);
	
КонецФункции

#КонецОбласти
